[
    {
      "title": "SQL vs. NoSQL Databases",
      "image": "https://techgeekbuzz.com/media/post_images/uploads/2021/11/SQL-vs-NoSQL.jpg",
      "details": "SQL databases are relational, NoSQL databases are non-relational.SQL databases use structured query language and have a predefined schema. NoSQL databases have dynamic schemas for unstructured data.SQL databases are vertically scalable, while NoSQL databases are horizontally scalable. SQL databases are table-based, while NoSQL databases are document, key-value, graph, or wide-column stores.SQL databases are better for multi-row transactions, while NoSQL is better for unstructured data like documents or JSON.",
      "author": {
        "name": "MD.Ikhtiaj Arif",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRbBMwRJfFeRL23d-4MB-yq_6NyJFUw7zprYQ&usqp=CAU"
      }
    },
    {
      "title": "What Is JWT? How Does It Work?",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQLicYkFyrJIjhfnwbtifo3Lwi7tRnjHkp34oyTtyjBwViiLSxO0Ml9w4Ii1EC_PW0prA8&usqp=CAU",
      "details": "JWT, or JSON Web Token, is an open standard used to share security information between two parties — a client and a server, JWTs differ from other web tokens in that they contain a set of claims. Claims are used to transmit information between two parties. What these claims are depends on the use case at hand. For example, a claim may assert who issued the token, how long it is valid for, or what permissions the client has been granted.",
      "author": {
        "name": "MD.Ikhtiaj Arif",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRbBMwRJfFeRL23d-4MB-yq_6NyJFUw7zprYQ&usqp=CAU"
      }
    },
    {
      "title": "Difference between Node.JS and Javascript ",
      "image": "https://blog.boot.dev/img/800/Nodejs-vs-Javascript-min.webp",
      "details": "1. NodeJS : NodeJS is a cross-platform and opensource Javascript runtime environment that allows the javascript to be run on the server-side. Nodejs allows Javascript code to run outside the browser. Nodejs comes with a lot of modules and mostly used in web development. 2. JavaScript : Javascript is a Scripting language. It is mostly abbreviated as JS. It can be said that Javascript is the updated version of the ECMA script. Javascript is a high-level programming language that uses the concept of Oops but it is based on prototype inheritance. ",
      "author": {
        "name": "MD.Ikhtiaj Arif",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRbBMwRJfFeRL23d-4MB-yq_6NyJFUw7zprYQ&usqp=CAU"
      }
    },
    {
      "title": " How does Node JS handle multiple requests at the same time?",
      "image": "https://news7h.com/wp-content/uploads/2022/07/Nodejs-Architecture.png",
      "details": "NodeJS receives multiple client requests and places them into EventQueue. NodeJS is built with the concept of event-driven architecture. NodeJS has its own EventLoop which is an infinite loop that receives requests and processes them. EventLoop is the listener for the EventQueue. If NodeJS can process the request without I/O blocking then the event loop would itself process the request and sends the response back to the client by itself. But, it is possible to process multiple requests parallelly using the NodeJS cluster module or worker_threads module.",
      "author": {
        "name": "MD.Ikhtiaj Arif",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRbBMwRJfFeRL23d-4MB-yq_6NyJFUw7zprYQ&usqp=CAU"
      }
    }
  ]